{
    "translation-revision-date": "2021-10-15 08:53+0000",
    "generator": "Loco https://localise.biz/",
    "source": "src/blocks/video.js",
    "domain": "toms-video-player",
    "locale_data": {
        "toms-video-player": {
            "": {
                "domain": "toms-video-player",
                "lang": "zh_CN",
                "plural-forms": "nplurals=1; plural=0;"
            },
            "Auto Picture in picture": [
                "自动画中画"
            ],
            "AutoPlay": [
                "自动播放"
            ],
            "Change a Video": [
                "更换视频"
            ],
            "Change an image": [
                "更换图像"
            ],
            "Choose a Video": [
                "选择一个视频"
            ],
            "Choose an image": [
                "选择一个图像"
            ],
            "Controls List Options": [
                "Controls List 选项"
            ],
            "Disabled Picture in picture": [
                "禁用画中画"
            ],
            "Disabled Responsive Video Size": [
                "禁用视频自适应"
            ],
            "Disabled Save video as...": [
                "禁用视频另存为..."
            ],
            "e.g. video/mp4": [
                "例如: video/mp4"
            ],
            "Empty Poster image URL !": [
                "清空图片地址！"
            ],
            "Empty this video URL!": [
                "清空视频地址！"
            ],
            "Enabled this option, A URL for an image to be shown while the video is downloading. If this attribute isn't specified, nothing is displayed until the first frame is available, then the first frame is shown as the poster frame.": [
                "选择一张图片作为视频海报."
            ],
            "Enabled this option, the video automatically begins to play back as soon as it can do so without stopping to finish loading the data. This may cause usability issues for some users.": [
                "启用此选项后，视频会在不停止加载数据的情况下立即开始播放。"
            ],
            "Height": [
                "高度"
            ],
            "If enabled this option that the video is to be played 'inline', that is within the element&apos;s playback area. Note that the absence of this attribute does not imply that the video will always be played in fullscreen.Enable Video Auto Picture in picture": [
                "如果启用此选项，该视频将播放\"内联\"，则位于元素的播放区域内。请注意，此属性的缺失并不意味着视频将始终在全屏上播放。在图片中启用视频自动图片"
            ],
            "If enabled, the audio will be initially silenced. Its default value is Disabled, meaning that the audio will be played when the video is played.": [
                "如果启用，音频将最初被静音。其默认值是禁用的，这意味着当播放视频时将播放音频。"
            ],
            "If enabled, the browser will automatically seek back to the start upon reaching the end of the video.": [
                "循环播放视频。"
            ],
            "If enabled, the Video screens will not be able to right-click.": [
                "如果启用，视频界面将禁止鼠标右键。"
            ],
            "If enabled, will remove the responsive style from the video elememt": [
                "启用后，将从视频中移除自适应样式"
            ],
            "If enabled, you can customize width and height in the video elememt": [
                "启用后，您可以手动设置视频的宽度和高度，您需要开启禁用视频自适应， 否则不会有任何效果，但是会添加宽度和高度属性给HTML5视频元素。"
            ],
            "If this attribute is enabled that the element should automatically toggle picture-in-picture mode when the user switches back and forth between this document and another document or application.": [
                "如果启用了此属性，则当用户在本文档和另一文档或应用程序之间来回切换时，该元素应自动切换图片中的模式。"
            ],
            "If this attribute is enabled, the browser will offer controls to allow the user to control video playback, including volume, seeking, and pause/resume playback.": [
                "如果启用此属性，将显示视频控制条，允许用户控制视频播放，包括音量、寻图和暂停/恢复播放。"
            ],
            "Image url": [
                "图片地址"
            ],
            "Loop": [
                "循环播放"
            ],
            "Muted": [
                "静音"
            ],
            "No Download": [
                "禁用下载按钮"
            ],
            "No Fullscreen": [
                "禁止全屏播放"
            ],
            "No Remote Playback": [
                "禁止远程播放"
            ],
            "Options Setting": [
                "可选设置"
            ],
            "Playback Controls": [
                "播放控制"
            ],
            "Plays Inline": [
                "内联播放"
            ],
            "Poster Image": [
                "海报图片"
            ],
            "Poster Image URL": [
                "海报图像URL"
            ],
            "Preload": [
                "预加载"
            ],
            "Prevents the browser from suggesting a Picture-in-Picture context menu or to request Picture-in-Picture automatically in some cases.": [
                "防止浏览器建议图片中的上下文菜单，或在某些情况下自动请求图片中的图片。"
            ],
            "Set video size manually": [
                "手动设置视频尺寸"
            ],
            "Source URL": [
                "Source URL"
            ],
            "Temporarily disable Video Block.": [
                "临时禁用此视频块."
            ],
            "The NoDownload keyword hints that the download control should be hidden when using the user agent's own set of controls for the media element.": [
                "勾选后隐藏视频下载按钮。"
            ],
            "The NoFullScreen keyword hints that the fullscreen mode control should be hidden when using the user agent's own set of controls for the media element.": [
                "勾选后视频将禁止全屏播放。"
            ],
            "The NoRemotePlayback keyword hints that the remote playback control should be hidden when using the user agent's own set of controls for the media element.": [
                "NoRemote 播放回关键字提示，在使用用户代理自己的媒体元素控制集时，应隐藏远程播放控制。"
            ],
            "Type&Codecs": [
                "Type&Codecs"
            ],
            "Video Block": [
                "视频块"
            ],
            "Video Settings": [
                "视频设置"
            ],
            "Video Url": [
                "视频地址"
            ],
            "Width": [
                "宽度"
            ],
            "Simply protect your videos from being downloaded 'Directly'.": [
                "简单的保护您的视频不被普通用户“直接下载”。"
            ],
            "TomS Video Player": [
                "TomS视频播放器"
            ]
        }
    }
}